{
  "intro": {
    "title": "Summary",
    "description": "Results-driven Software Engineer and Computer Science undergraduate with a strong focus on data engineering. Experienced in building scalable data pipelines, optimizing cloud infrastructure, and implementing DevOps practices to enhance data-driven decision-making."
  },
  "work": {
    "title": "Experience",
    "experiences": [
      {
        "company": "Gojek",
        "timeframe": "Mar 2020 - Oct 2020",
        "role": "Machine Learning Engineer Intern",
        "achievements": [
          "Developed an open-source ML Feature Store, optimizing data processing efficiency for real-time matchmaking models using Python, Java, Golang, Kafka, and Redis.",
          "Resolved a Redis schema mismatch in production, ensuring seamless data ingestion and preventing system downtime.",
          "Designed and deployed a real-time analytics dashboard with Grafana and GCP BigQuery, enhancing data visibility for stakeholders."
        ]
      },
      {
        "company": "Tinkertanker",
        "timeframe": "Jan 2018 - Apr 2018",
        "role": "Software Engineer Intern",
        "achievements": [
          "Engineered a robust instructor-course allocation system using Python, Django, and PostgreSQL, replacing a manual spreadsheet-based process and improving efficiency.",
          "Developed a responsive UI with Jinja, HTML, and JavaScript, enhancing usability and accessibility.",
          "Implemented CI/CD pipelines with GitHub Actions, improving deployment automation and system reliability."
        ]
      }
    ]
  },
  "projects": {
    "title": "Projects",
    "projects": [
      {
        "name": "Flowmotion",
        "timeframe": "Sep 2024 - Nov 2024",
        "achievements": [
          "Built a real-time traffic congestion routing app leveraging live camera feeds and machine learning to optimize route recommendations.",
          "Integrated a YOLOv8-based ML model for congestion analysis and real-time route optimization via the OSRM API.",
          "Developed a cross-platform mobile app with Flutter, managing cloud infrastructure using Firebase and Google Cloud for scalable deployment."
        ],
        "links": {
          "github": "https://github.com/ZhiXin18/flowmotion",
          "writeup": "https://mrzzy.co/work/flowmotion-real-time-routing-for-sg-drivers"
        }
      },
      {
        "name": "Providence",
        "timeframe": "Nov 2023 - Nov 2024",
        "achievements": [
          "Designed and automated an ELT pipeline integrating multi-source personal finance data, enhancing budgeting insights.",
          "Optimized cloud architecture by migrating to DuckDB, reducing query costs and improving data retrieval speeds.",
          "Developed an interactive financial dashboard using Apache Superset, enabling real-time data visualization and decision-making."
        ],
        "links": {
          "github": "https://github.com/mrzzy/providence",
          "writeup": "https://mrzzy.co/work/providence-data-engineering-personal-finance"
        }
      }
    ]
  },
  "studies": {
    "title": "Education",
    "institutions": [
      {
        "name": "Nanyang Technological University",
        "timeframe": "Aug 2023 - Present",
        "qualification": "Bachelor of Computing in Computer Science"
      },
      {
        "name": "Ngee Ann Polytechnic",
        "timeframe": "Apr 2018 - Apr 2021",
        "qualification": "Diploma in Information Technology"
      }
    ]
  },
  "skills": {
    "title": "Skills",
    "skillsets": [
      {
        "name": "Data Engineering",
        "skills": "Python, SQL, Spark, DBT, Prefect, Data Modeling, Data Warehousing, ETL Pipelines, Data Contracts"
      },
      {
        "name": "Cloud Infrastructure",
        "skills": "GCP, AWS, Terraform, Docker, Kubernetes, CI/CD, GitHub Actions, Infrastructure-as-Code (IaC)"
      },
      {
        "name": "Databases / Analytics",
        "skills": "PostgreSQL, Redis, BigQuery, DuckDB, Firestore, Data Monitoring, Apache Superset, Grafana"
      },
      {
        "name": "Software Engineering / DevOps",
        "skills": "Java, Golang, TypeScript, Node.js, API Development, Version Control (Git), Unit Testing, Agile, Scrum"
      }
    ]
  }
}
